---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
source: html/c45f77c9-268c-6619-328e-568a1b770979.htm
---
# RevitAPISingleEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.